org/infomation_analysis.org
#+TITLE:     情報の解析
#+AUTHOR:    Shigeaki Matsumura
#+EMAIL:     matsu911@gmail.com
#+DATE:      2012-03-16 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: http://matsu911.github.com
#+XSLT:
#+STYLE: <link rel="stylesheet" type="text/css" href="main.css" />

#+INCLUDE: "head.org"

この文書は産業技術大学院大学主催の[[http://pk.aiit.ac.jp/index.php?InfoTalk%252F20120316][第40回InfoTalk]]の内容をまとめたものです。
この講演はUstreamでも配信されており、[[http://www.ustream.tv/recorded/21139050][ここ]]から視聴できます。

* 消費者が生み出す情報の分析 ― 行動情報からCGMの解析まで
飯尾 淳 氏＝株式会社三菱総合研究所 先進ビジネス推進本部 主席研究員
** 飯尾 淳 氏＝株式会社三菱総合研究所 先進ビジネス推進本部 主席研究員
** 技術のハイプサイクル
** クラウドコンピューティング活用による価値の創出 
** 事例その1
*** 情報大航海プロジェクト
**** 行動情報マイニング
+ i-modeのアプリを配布
+ 位置情報を10分おきに収集
+ 携帯の開け閉めを補足
+ ユーザーの匿名化(事前に消費傾向等の個人の属性を収集)
** 既存手法との比較
*** オンラインアンケート
+ 必ずしも回答通りの行動が取れているとは限らない
*** 交通量調査
+ 目視で属性を推定

* 大規模データに基づく解析手法の動向と今後の課題 - 大きな数を正確に数える
白井 康之 氏＝（独）科学技術振興機構 ERATO湊離散構造処理系プロジェクト 技術参事
** 問題(スマートグリッド上の配電)
変電所と送電線とON/OFFスイッチから構成される配電網がある。
このとき、変電所から各家庭に電力を供給する方法は何通りあるか？
また最適な構成を求めよ。
** 問題(日本地図上のパス)
北海道から鹿児島県までの県庁所在地をすべて到達する方法は何通りあるか？
また二度づつ訪ずれるとしたらどうなるか？
** 問題(情報推薦)
クラスPに属する事例集合とクラスNに属する事例集合がある。
ここでNに属する新しい事例に対して
** 問題(あみだくじ)
** 列挙によるアプローチ
制約充足問題ではないのか？=> yes
ただ、制約が緩く、すべてを数え上げるのは困難。
近似解でも良いのではないのか？ => yes
ただ近似のレベルが問題。
** データの大容量化、複雑化
** 計算時間がかかる問題の例
*** 超巨大なデータを扱う計算
+ コンビニチェーンの購買データ
+ ヒトゲノム
*** データはそれほど巨大でないが、膨大な場合分けが必要なもの
+ カーナビの最短経路の探索
+ 囲碁、将棋のかちまけパタンの分類
*** データがあると色気も出てくる
+ ゲノムの組み合わせによる遺伝情報の解析
** 余談：いろいろな巨大数
+ 組み合わせ論的数
** 組み合わせ論的数： 身近な問題
クーポン券が10枚あります。1000円の商品を買いたいのですが、おつりは出ません。ぴったりの組合せはいくつあるでしょうか？
** 直感的な探索木の縮約
+ ノードが大きくなると削減効率が高くなる
** BDD/ZDDの概要
+ Binary Decision Diagram(BDD)は論理関数を効率的に表現する方法であり、計算手法である
+ BryantがBDDを提唱したのが1986年で長期間情報科学分野での最多引用文献であった
+ しかし時期が熟していなかった
+ 一方インターネットの普及で膨大かつスパース
+ BDDの変種ZDDはスパースなデータを対象としたデータ構造で、近年開発がさかん
*** BDD
+ 論理関数を効率的に表現、計算するための手法
+ 共通部分集合の表現、スパースな構造の表現において圧縮効率が高い
** BDD/ZDDの簡約化規則
** BDD簡約化の効率
** さまざまな*DDファミリー
|                | BDD | ZDD | SeqBDD | πDD   | ... |
|----------------+-----+-----+--------+------+-----|
| 概要           |     |     |        |      |     |
| 発表           |     |     |        |      |     |
| 想定される応用 |     |     |        |      |     |
** ZDDは大きな数の数え上げが特に得意
+ パス列挙問題
** スマートグリッド配電網への応用
+ 近似的な方法は知られていた
+ ZDDを使って網羅的に調べよう
+ 林泰弘教授らとの共同研究
** 制約条件
+ すべての家庭に繋ぐ
+ 膨大な数の構成要素
+ 最適性
** 配電網の標準解析モデル
** 配電網構成とZDDの対応
** 標準解析モデルへの適用結果
** 損失最小構成の探索
+ 最適なものでも送電損失は3%削減(火力発電0.1基分)
** 今後の展開
+ ZDDで索引化されているため運用の都合や故障対応といった追加の制約条件に対して絞り込みが用意
+ あるアイテム集合が含まれるかどうか、あるいは部分アイテムを含む(含まないさく)解集合を抽出するのは簡単
+ 解のカウントは得意
+ 抽出した部分集合同士の集合演算
** 概要(クラス差分に基づく情報推薦機能)
*** 協調フィルタリング
+ 類似したレコードから、追加すべきアイテムを推薦
*** クラス差分に基づく情報推薦
+ クラス間の差異に基づき追加、削除すべきアイテムセットを推薦
*** 情報推薦へのZDDの適用
** 一般的な情報推薦(協調フィルタリング)
** クラス間の差異に基づく情報推薦
+ 集合の過不足を推薦する
+ 文脈をもった推薦
** 想定されるアプリケーション
+ 生活行動履歴
+ 検索キーワード
+ レシピ
** 余談
*** 公開データ
+ 楽天のデータ(ユーザーの行動履歴が公開されていない)
+ livedoorアグルメ
+ Yahoo!知恵袋
+ AOL Search Log
** 検討中の課題
+ 料理のレシピ
+ 論文データにおけるキーワード
+ 健康支援
** 余談(クラウドソーシングサービス [[http://www.lancers.jp/][Lancers]])
+ 仕事マーケットプレイス
+ あまりに素早い反応にびっくり
+ 質も悪くなく、コストパフォーマンス的には評価できる
** 検討中の課題2
** 検討中の課題3 株価変動予測
+ 新聞記事から株価の上下を予測
